app/views/menus/_superior.erb

SELECT `menus`.* FROM `menus` WHERE (`menus`.`father_id` = 1)
---
    <!-- ============================= Menus de segundo nivel ==================== -->
    <% Menu.find(:all, :conditions => {:father_id => menu.id }).each do |sub| %>