app/views/users/index.html.erb

          <%# Verfica se o usuário possui o papel %>
          <% if current_user && !user.role_ids.empty? %>
---
SELECT id,name FROM `roles` GROUP BY name,id ORDER BY id