app/views/settings/index.html.erb

          <th><%= t('setting.name') %></th>
          <th><%= t('setting.value') %></th>
---
SELECT `settings`.* FROM `settings` ORDER BY position