app/views/rights/index.html.erb

<%#  current_user.roles.each do |role|
      role.rights.each do |right|
---
SELECT `rights`.* FROM `rights` ORDER BY controller,name