app/views/roles/index.html.erb

    <div class="contextual">
      <p><%= link_to (t"create_param", :param => t("role.one")), new_role_path, :class => 'icon icon-add' %></p>
---
SELECT `roles`.* FROM `roles` ORDER BY id

              <td>
                <%= check_box_tag "role[#{role.id}][right_ids][]", right.id, role.rights.include?(right), :id => nil, :class => "column-#{role.id}" %>
---
SELECT `rights`.* FROM `rights` ORDER BY controller,name