app/views/roles/show.html.erb

SELECT `rights`.* FROM `rights` ORDER BY id
---
           <%#= check_box_tag "role_ids[#{role.id}][right_ids][]", right.id, role.rights.include?(right), :id => nil %>
            <%= check_box_tag "right_ids[#{right.id}][role_ids][]", role.id, role.rights.include?(right), :id => nil %>