app/controllers/menus_controller.rb

SELECT `menus`.* FROM `menus` WHERE (`menus`.`position` = 'Esquerdo')
---
  def index
    @esquerdo = Menu.find(:all, :conditions => {:position => "Esquerdo"})

INSERT INTO `menus` (`created_at`, `father_id`, `link`, `position`, `title`, `updated_at`) VALUES ('2010-06-17 22:27:25', NULL, NULL, 'Superior', '', '2010-06-17 22:27:25')
---
  def create
    @menu = Menu.new(params[:menu])
    respond_with(@menu)
    @menu.save