app/controllers/paginas_controller.rb

  def index
    @paginas = Pagina.all
---
SELECT `paginas`.* FROM `paginas`