app/controllers/rights_controller.rb

  def index
    @rights = Right.order("controller,name")
---
SELECT `rights`.* FROM `rights` ORDER BY controller,name