app/controllers/roles_controller.rb

SELECT `roles`.* FROM `roles` ORDER BY id
SELECT `rights`.* FROM `rights` ORDER BY controller,name
---
  def index
    @roles = @site ? @site.roles.order("id") : Role.order("id")
    @rights = Right.order("controller,name")

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 1) LIMIT 1
---
  def edit
    @role = Role.find(params[:id])

SELECT `roles`.* FROM `roles` ORDER BY id
SELECT `rights`.* FROM `rights` ORDER BY id
---
  def show
    @role = Role.new
    @roles = Role.order("id")
    @rights = Right.order("id")

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 1) LIMIT 1
---
  def update
    @role = Role.find(params[:id])