app/controllers/settings_controller.rb

SELECT `settings`.* FROM `settings` ORDER BY position
---
  def index
    if request.put?
      RolesSetting.delete_all()
      unless params[:group_osses].nil?
        params[:group_osses].each do |set, role|
          Setting.find(set).update_attributes(role)
        end
      end

      Setting.update_all("value = '#{params[:group_phone]}'", "settings.group = 'phone'")