app/controllers/users_controller.rb

SELECT `roles`.* FROM `roles` WHERE (`roles`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])
    @roles = Role.find(params[:id])