app/controllers/users_controller.rb

UPDATE `users` SET `last_request_at` = '2010-06-17 20:29:43', `perishable_token` = 'ieH0WLEhixcOcEWEkypg' WHERE (`users`.`id` = 1)
---
  def change_theme
    if params[:id] && current_user
      @user = current_user
      @user.update_attribute(:theme, params[:id])

SELECT COUNT(*) AS count_id FROM `users` WHERE (last_request_at > '2010-06-18 21:46:11')
SELECT `users`.* FROM `users` ORDER BY id DESC LIMIT 0, 10
SELECT id,name FROM `roles` GROUP BY name,id ORDER BY id
---
  def index
    @users = User.login_or_name_like(params[:search]).
      order(sort_column + " " + sort_direction).page(params[:page]).
      per(params[:per_page])

    if @site
      @users = @users.by_site(@site.id)
    end

    @roles = Role.select('id, name, theme').
      group("id, name, theme").order("id")

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `last_request_at` = '2010-06-17 11:20:39', `perishable_token` = '0CO3j7cYt5L4Ug4tlkWC' WHERE (`users`.`id` = 1)
---
  def update
    unless current_user.is_admin
      params[:id] = current_user.id
    end
    @user = User.find(params[:id])
    @user.update_attributes(user_params)

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `last_request_at` = '2010-06-17 20:23:31', `perishable_token` = 'yz_zh49U0zsMu1rGianp' WHERE (`users`.`id` = 1)
---
  def set_admin
    @user = User.find(params[:id])
    if params[:field]
      if @user.update_attributes(params[:field] => (@user[params[:field]] == 0 or not @user[params[:field]] ? true : false))